In [1]:
import numpy as np
import pandas as pd

## 1- Create DataFrame

In [2]:
columns = ['name', 'age', 'gender', 'job']

user1 = pd.DataFrame([['alice', 19, "F", "student"],
                      ['john', 26, "M", "student"]],
                     columns=columns)

user2 = pd.DataFrame([['eric', 22, "M", "student"],
                      ['paul', 58, "F", "manager"]],
                     columns=columns)

user3 = pd.DataFrame(dict(name=['peter', 'julie'],
                          age=[33, 44], gender=['M', 'F'],
                          job=['engineer', 'scientist']))
print(user1)
print(user2)
print(user3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager
    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

## 2- Combining DataFrames

### Concatenate DataFrame

In [3]:
# Concatenate columns (axis = 1).
height = pd.DataFrame(dict(height=[1.65, 1.8]))
print(user1, "\n", height)

print(pd.concat([user1, height], axis=1))

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
    height
0    1.65
1    1.80
    name  age gender      job  height
0  alice   19      F  student    1.65
1   john   26      M  student    1.80

In [4]:
# Concatenate rows (default: axis = 0)
users = pd.concat([user1, user2, user3])
print(users)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [5]:
# Concatenate rows: append
user1.append(user2)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

### Join DataFrame

In [6]:
user4 = pd.DataFrame(dict(name=['alice', 'john', 'eric', 'julie'],
height=[165, 180, 175, 171]))
print(user4)

    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171

In [7]:
# Use intersection of keys from both frames
merge_inter = pd.merge(users, user4)

print(merge_inter)

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [8]:
# Use union of keys from both frames
users = pd.merge(users, user4, on="name", how='outer')
print(users)

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

### Reshaping by pivoting

In [9]:
# "Unpivots" a DataFrame from wide format to long (stacked) format
staked = pd.melt(users, id_vars="name", var_name="variable", value_name="value")
print(staked)

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist
18  alice   height      165.0
19   john   height      180.0
20   eric   height      175.0
21   paul   height        NaN
22  peter   height        NaN
23  julie   height      171.0

In [10]:
# "pivots" a DataFrame from long (stacked) format to wide format
print(staked.pivot(index='name', columns='variable', values='value'))

variable age gender height        job
name
alice     19      F  165.0    student
eric      22      M  175.0    student
john      26      M  180.0    student
julie     44      F  171.0  scientist
paul      58      F    NaN    manager
peter     33      M    NaN   engineer

## Summarizing

In [11]:
users        # print the first 30 and last 30 rows
type(users)  # DataFrame
users.head() # print the first 5 rows
users.tail() # print the last 5 rows

    name  age gender        job  height
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [12]:
users.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,peter,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,M,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
height,4.0,NaN,NaN,NaN,172.75,6.344289,165.0,169.5,173.0,176.25,180.0

In [13]:
users.index   # "Row names"
users.columns # column names
users.dtypes  # data types of each column
users.values  # underlying numpy array
users.shape   # number of rows and columns

(6, 5)

## 4- Columns Selection

In [14]:
users['gender']         # select one column
type(users['gender'])   # Series
users.gender            # select one column using the DataFrame

# select multiple columns
users[['age', 'gender']]        # select two columns
my_cols = ['age', 'gender']     # or, create a list...
users[my_cols]                  # ...and use that list to select columns
type(users[my_cols])            # DataFrame

pandas.core.frame.DataFrame

## 5- Rows Selection

In [15]:
# iloc
df = users.copy()
df.iloc[0]     # first row
df.iloc[0, :]  # first row
df.iloc[0, 0]  # first item of first row
df.iloc[0, 0] = 55

In [16]:
# loc
df.loc[0]         # first row
df.loc[0, :]      # first row
df.loc[0, "age"]  # age item of first row
df.loc[0, "age"] = 55

In [17]:
# select females into a new df
df = users[users.gender == "F"]
print(df)

    name  age gender        job  height
0  alice   19      F    student   165.0
3   paul   58      F    manager     NaN
5  julie   44      F  scientist   171.0

In [18]:
# Get the two first rows using iloc
df.iloc[[0, 1], :]

    name  age gender      job  height
0  alice   19      F  student   165.0
3   paul   58      F  manager     NaN

## 7- Rows Iteration

### iterrows(): slow, get series, read-only

In [19]:
df = users[:2].copy()

In [20]:
for idx, row in df.iterrows():
    print(row["name"], row["age"])

alice 19
john 26

### itertuples(): fast, get namedtuples, read-only

In [21]:
for tup in df.itertuples():
    print(tup[1], tup[2])

alice 19
john 26

### iter using loc: read and write

In [22]:
for i in range(df.shape[0]):
    df.loc[i, "age"] *= 10  # df is modified

## 8- Rows selection (filtering)

In [24]:
# simple logical filtering on numerical values
users[users.age < 20]        # only show users with age < 20
young_bool = users.age < 20  # or, create a Series of booleans...
young = users[young_bool]            # ...and use that Series to filter rows
users[users.age < 20].job    # select one column from the filtered results
print(young)

    name  age gender      job  height
0  alice   19      F  student   165.0

In [25]:
# simple logical filtering on categorical values
users[users.job == 'student']
users[users.job.isin(['student', 'engineer'])]
users[users['job'].str.contains("stu|scient")]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [26]:
# advancing logical filtering
users[users.age < 20][['age', 'job']]            # select multiple columns
users[(users.age > 20) & (users.gender == 'M')]  # use multiple conditions

    name  age gender       job  height
1   john   26      M   student   180.0
2   eric   22      M   student   175.0
4  peter   33      M  engineer     NaN

## 9- Sorting

In [27]:
df = users.copy()
df.age.sort_values() # only works for a Series
df.sort_values(by='age') # sort rows by a specific column
df.sort_values(by='age', ascending=False) # use descending order instead
df.sort_values(by=['job', 'age']) # sort by multiple columns
df.sort_values(by=['job', 'age'], inplace=True) # modify df
print(df)

    name  age gender        job  height
4  peter   33      M   engineer     NaN
3   paul   58      F    manager     NaN
5  julie   44      F  scientist   171.0
0  alice   19      F    student   165.0
2   eric   22      M    student   175.0
1   john   26      M    student   180.0

## 10- Descriptive Statistics

In [30]:
# summarize all numeric columns
print(df.describe().T)

        count        mean        std    min    25%    50%     75%    max
age       6.0   33.666667  14.895189   19.0   23.0   29.5   41.25   58.0
height    4.0  172.750000   6.344289  165.0  169.5  173.0  176.25  180.0

In [36]:
# summarize all columns
print(df.describe(include='all').T)
print(df.describe(include=['object']).T)  # limit to one (or more) types

       count unique      top freq       mean        std    min    25%    50%  \
name       6      6    peter    1        NaN        NaN    NaN    NaN    NaN
age      6.0    NaN      NaN  NaN  33.666667  14.895189   19.0   23.0   29.5
gender     6      2        M    3        NaN        NaN    NaN    NaN    NaN
job        6      4  student    3        NaN        NaN    NaN    NaN    NaN
height   4.0    NaN      NaN  NaN     172.75   6.344289  165.0  169.5  173.0

           75%    max
name       NaN    NaN
age      41.25   58.0
gender     NaN    NaN
job        NaN    NaN
height  176.25  180.0
       count unique      top freq
name       6      6    peter    1
gender     6      2        M    3
job        6      4  student    3

In [39]:
# Statistics per group (groupby)
print(df.groupby("job").mean())

print(df.groupby("job")["age"].mean())

print(df.groupby("job").describe(include='all'))

                 age      height
job
engineer   33.000000         NaN
manager    58.000000         NaN
scientist  44.000000  171.000000
student    22.333333  173.333333
job
engineer     33.000000
manager      58.000000
scientist    44.000000
student      22.333333
Name: age, dtype: float64
           name                                                   ... height  \
          count unique    top freq mean  std  min  25%  50%  75%  ... unique
job                                                               ...
engineer      1      1  peter    1  NaN  NaN  NaN  NaN  NaN  NaN  ...    NaN
manager       1      1   paul    1  NaN  NaN  NaN  NaN  NaN  NaN  ...    NaN
scientist     1      1  julie    1  NaN  NaN  NaN  NaN  NaN  NaN  ...    NaN
student       3      3   eric    1  NaN  NaN  NaN  NaN  NaN  NaN  ...    NaN


          top freq        mean       std    min    25%    50%    75%    max
job
engineer  NaN  NaN         NaN       NaN    NaN    NaN    NaN    NaN    NaN
manager   NaN  NaN         NaN       NaN    NaN    NaN    NaN    NaN    NaN
scientist NaN  NaN  171.000000       NaN  171.0  171.0  171.0  171.0  171.0
student   NaN  NaN  173.333333  7.637626  165.0  170.0  175.0  177.5  180.0

[4 rows x 44 columns]

## 11- Quality Check

### Remove duplicate data

In [40]:
df = users.append(users.iloc[0], ignore_index=True)

print(df.duplicated())                 # Series of booleans
# (True if a row is identical to a previous row)
df.duplicated().sum()                  # count of duplicates
df[df.duplicated()]                    # only show duplicates
df.age.duplicated()                    # check a single column for duplicates
df.duplicated(['age', 'gender']).sum() # specify columns for finding duplicates
df = df.drop_duplicates()              # drop duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

### Missing data

In [41]:
# Missing values are often just excluded
df = users.copy()

df.describe(include='all')

# find missing values in a Series
df.height.isnull()           # True if NaN, False otherwise
df.height.notnull()          # False if NaN, True otherwise
df[df.height.notnull()]      # only show rows where age is not NaN
df.height.isnull().sum()     # count the missing values

# find missing values in a DataFrame
df.isnull()             # DataFrame of booleans
df.isnull().sum()       # calculate the sum of each column

name      0
age       0
gender    0
job       0
height    2
dtype: int64

#### Strategy 1: drop missing values

In [42]:
df.dropna()             # drop a row if ANY values are missing
df.dropna(how='all')    # drop a row only if ALL values are missing

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

#### Strategy 2: fill in missing values

In [43]:
df.height.mean()
df = users.copy()
df.loc[df.height.isnull(), "height"] = df["height"].mean()

print(df)

    name  age gender        job  height
0  alice   19      F    student  165.00
1   john   26      M    student  180.00
2   eric   22      M    student  175.00
3   paul   58      F    manager  172.75
4  peter   33      M   engineer  172.75
5  julie   44      F  scientist  171.00

## 12- Operation: Multiplication

In [44]:
# element-wise
df = users.dropna()
df.insert(0, 'random', np.arange(df.shape[0]))
print(df)
df[["age", "height"]].multiply(df["random"], axis="index")

   random   name  age gender        job  height
0       0  alice   19      F    student   165.0
1       1   john   26      M    student   180.0
2       2   eric   22      M    student   175.0
5       3  julie   44      F  scientist   171.0

   age  height
0    0     0.0
1   26   180.0
2   44   350.0
5  132   513.0

## 13- Renaming

In [45]:
# rename columns
df = users.copy()
df.rename(columns={'name': 'NAME'})

    NAME  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [46]:
# Rename values
df.job = df.job.map({'student': 'etudiant', 'manager': 'manager',
                     'engineer': 'ingenieur', 'scientist': 'scientific'})

## 14- Dealing with Outliers

In [47]:
size = pd.Series(np.random.normal(loc=175, size=20, scale=10))
# Corrupt the first 3 measures
size[:3] += 500

### Based on parametric statistics: use the mean
- Assume random variable follows the normal distribution Exclude data outside 3 standard-deviations: - Probability that a sample lies within 1 sd: 68.27% - Probability that a sample lies within 3 sd: 99.73% (68.27 + 2 * 15.73)

In [48]:
size_outlr_mean = size.copy()
size_outlr_mean[((size - size.mean()).abs() > 3 * size.std())] = size.mean()
print(size_outlr_mean.mean())

250.0329616680643

### Based on non-parametric statistics: use the median

In [49]:
mad = 1.4826 * np.median(np.abs(size - size.median()))
size_outlr_mad = size.copy()

size_outlr_mad[((size - size.median()).abs() > 3 * mad)] = size.median()
print(size_outlr_mad.mean(), size_outlr_mad.median())

175.56350771521792 175.59431008311768

## 15- File I/O

### csv

In [50]:
import tempfile, os.path

tmpdir = tempfile.gettempdir()
csv_filename = os.path.join(tmpdir, "users.csv")
users.to_csv(csv_filename, index=False)
other = pd.read_csv(csv_filename)

In [51]:
# read csv from url
url = 'https://github.com/duchesnay/pystatsml/raw/master/datasets/salary_table.csv'
salary = pd.read_csv(url)

### excel

In [52]:
xls_filename = os.path.join(tmpdir, "users.xlsx")
users.to_excel(xls_filename, sheet_name='users', index=False)

pd.read_excel(xls_filename, sheet_name='users')

# Multiple sheets
with pd.ExcelWriter(xls_filename) as writer:
    users.to_excel(writer, sheet_name='users', index=False)
    df.to_excel(writer, sheet_name='salary', index=False)

pd.read_excel(xls_filename, sheet_name='users')
pd.read_excel(xls_filename, sheet_name='salary')

    name  age gender         job  height
0  alice   19      F    etudiant   165.0
1   john   26      M    etudiant   180.0
2   eric   22      M    etudiant   175.0
3   paul   58      F     manager     NaN
4  peter   33      M   ingenieur     NaN
5  julie   44      F  scientific   171.0